// StudentsArray.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
using namespace std;
struct Student
{
    int id;
    string name;
    int age;
    //...
};


int main()
{
    setlocale(LC_ALL, "");
    Student* students = new Student[4]; //sizeof(Student)*4
    
    for (int i = 0; i < 4; i++)
    {
        students[i].id = i;
        cout << "Введите имя студента: ";
        cin >> students[i].name;
        cout << "Введите возраст студента: ";
        cin >> students[i].age;
    }
    delete[] students;

    Student* student = new Student;
    student->id = 9;
    (*student).name = "Вася"; // то же
    student->age = 20;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
